AlexM-dev/RoboCup-STM32/Lightweight/src/main/main.cpp
	static Pin txTsop(GPIO_Pin_6,
						 GPIOC,
						 GPIO_Mode_AF,
						 TIM3,
						 CHANNEL1,
						 RCC_APB1Periph_TIM3,
						 GPIO_PinSource6,
						 GPIO_AF_USART6,
						 4096,
						 1,
						 GPIO_OType_PP,
						 GPIO_PuPd_DOWN);
	static Pin rxTsop(GPIO_Pin_7,
						 GPIOC,
						 GPIO_Mode_AF,
						 TIM3,
						 CHANNEL2,
						 RCC_APB1Periph_TIM3,
						 GPIO_PinSource7,
						 GPIO_AF_USART6,
						 4096,
						 1,
						 GPIO_OType_PP,
						 GPIO_PuPd_DOWN);
	lowerBoard tsop(txTsop, rxTsop);
 
	static Pin txCam(GPIO_Pin_2,
						 GPIOA,
						 GPIO_Mode_AF,
						 TIM3,
						 CHANNEL2,
						 RCC_APB1Periph_TIM3,
						 GPIO_PinSource2,
						 GPIO_AF_USART2,
						 4096,
						 1,
						 GPIO_OType_PP,
						 GPIO_PuPd_DOWN);
 static Pin rxCam(GPIO_Pin_3,
						 GPIOA,
						 GPIO_Mode_AF,
						 TIM3,
						 CHANNEL2,
						 RCC_APB1Periph_TIM3,
						 GPIO_PinSource3,
						 GPIO_AF_USART2,
						 4096,
						 1,
						 GPIO_OType_PP,
						 GPIO_PuPd_DOWN);
 	static Camera cam(txCam, rxCam);
 
 static Pin txGyro(GPIO_Pin_0,
						 GPIOA,
						 GPIO_Mode_AF,
						 TIM5,
						 CHANNEL1,
						 RCC_APB1Periph_TIM5,
						 GPIO_PinSource0,
						 GPIO_AF_UART4,
						 4096,
						 1,
						 GPIO_OType_PP,
						 GPIO_PuPd_DOWN);
 static Pin rxGyro(GPIO_Pin_1,
						 GPIOA,
						 GPIO_Mode_AF,
						 TIM5,
						 CHANNEL2,
						 RCC_APB1Periph_TIM5,
						 GPIO_PinSource1,
						 GPIO_AF_UART4,
						 4096,
						 1,
						 GPIO_OType_PP,
						 GPIO_PuPd_DOWN); 
  gyro gyro(txGyro, rxGyro);
 
 	static Pin lightSensor(GPIO_Pin_2,
			 GPIOC,
			 GPIO_Mode_OUT,
			 TIM8,
			 CHANNEL1,
			 RCC_APB2Periph_TIM8,
			 GPIO_PinSource2,
			 GPIO_AF_TIM8,
			 4096,
			 1,
			 GPIO_OType_PP,
			 GPIO_PuPd_DOWN);
	lightSensor.pinInit();
	lightSensor.setBit();
 
	/*line_sensors line(_SPI1);
 
	static Pin switchPin(GPIO_Pin_0,
				 GPIOC,
					GPIO_Mode_IN,
				 TIM3,
				 CHANNEL2,
				 RCC_APB1Periph_TIM3,
				 GPIO_PinSource0,
				 GPIO_AF_USART1,
				 4096,
				 1,
				 GPIO_OType_PP,
				 GPIO_PuPd_DOWN);
	switchPin.pinInit();
	
	 
	static Pin button(GPIO_Pin_2,
				 GPIOC,
					GPIO_Mode_IN,
				 TIM3,
				 CHANNEL2,
				 RCC_APB1Periph_TIM3,
				 GPIO_PinSource2,
				 GPIO_AF_USART1,
				 4096,
				 1,
				 GPIO_OType_PP,
				 GPIO_PuPd_DOWN);
	button.pinInit();
	
	static Pin ballSensor(GPIO_Pin_1,
			 GPIOC,
			 GPIO_Mode_AN,
			 TIM3,
			 CHANNEL2,
			 RCC_APB1Periph_TIM3,
			 GPIO_PinSource1,
			 GPIO_AF_USART1,
			 4096,
			 1,
			 GPIO_OType_PP,
			 GPIO_PuPd_NOPULL);
	ballSensor.pinInit();
	Adc mpAdc(ADC1, 1, 0, ADC_Channel_11, RCC_APB2Periph_ADC1, ballSensor);
	mpAdc.sendMeChannel(ADC_Channel_11);
	mpAdc.adcInit();
	mpAdc.startAdc();
	mpAdc.setChannel();
	ADC_SoftwareStartConv(ADC1);*/
	static Pin ballSensor(GPIO_Pin_3,
			 GPIOC,
			 GPIO_Mode_AN,
			 TIM3,
			 CHANNEL2,
			 RCC_APB1Periph_TIM3,
			 GPIO_PinSource3,
			 GPIO_AF_USART1,
			 4096,
			 1,
			 GPIO_OType_PP,
			 GPIO_PuPd_DOWN);
	ballSensor.pinInit();
	Adc mpAdc(ADC1, 1, 0, ADC_Channel_13, RCC_APB2Periph_ADC1, ballSensor);
	mpAdc.sendMeChannel(ADC_Channel_13);
	mpAdc.adcInit();
	mpAdc.startAdc();
	mpAdc.setChannel();
	ADC_SoftwareStartConv(ADC1);
	//mpAdc.getAdc
	int ballSensorRes = 0;	
	unsigned long ballSensorTimer = 0;
	volatile bool ballCathed = false, ballCathedFlag = false;
	
	lightTransistor.setBit();
	robotMotion robot(m1, m2, m3, m4);
	robot.robotInit();
	mathematics math;
	
	bool startMovingFlag = 0;
	long startMovingTimer = millis();
	
	
	//IMU imu;
	//imu.init(_SPI1, PA1);
	
	int32_t sp1 = 0;
	int32_t sp2 = 0; 
	int32_t sp3 = 0;
	int32_t sp4 = 0;
	
	bool pressFlag[4] = {0};
	
	int k = 0;
	int gkGo = 0;
	unsigned long timer = 0, kickTimer = 0, goBackTimer;
	volatile bool f = false, updateF = false;
	int state = 0;
	int goalSide = 0;
	int32_t sp = 0, ang = 0;
	math.setPeriod(period);
	int strategyState = CODE;
	int kickState = 0;
	int kickSector = 0;
	
	volatile int testAng = 0; 
	int pwm = 120;
	
	int dribblerOn = 0;
	
	bool mKick = 0;
	
	bool runFlag = 0;
	bool gyroFlag = 0;
	bool goBackFlag = 0;
	delay(500);
	dribbler.pwm(120);
	delay(500);
	dribbler.pwm(250);
	delay(500);
	dribbler.pwm(120);
	while(1)
	{
		ballSensorRes = (int)ADC1->DR;
		if (ballCathed && ballSensorRes > BALL_SENSOR_THRESHOLD) { 
			if (!ballCathedFlag) {
				ballCathedFlag = 1;
				ballSensorTimer = millis();
			} else {
				if (millis() - ballSensorTimer > 1000) {
					ballCathedFlag = 0; 
					ballCathed = !ballCathed;
				}
			}
		} else if (!ballCathed && ballSensorRes < BALL_SENSOR_THRESHOLD) {
			if (!ballCathedFlag) {
				ballCathedFlag = 1;
				ballSensorTimer = millis();
			} else {
				if (millis() - ballSensorTimer > 50) {
					ballCathedFlag = 0; 
					ballCathed = !ballCathed;
				}
			}
		} else {
			ballCathedFlag = 0;
		}

		gyro.read();
		cam.readData();
		tsop.read();
		if(startButton.readPin() && pressFlag[0] == 0){
			pressFlag[0] = 1;
		}
		if(!startButton.readPin() && pressFlag[0] == 1){
			pressFlag[0] = 0;
			runFlag = !runFlag;
			if (runFlag && abs(float(tsop.getAngle())) < 45 && tsop.getDist() > BALL_IS_NEAR) {
				startMovingFlag = 1;
				startMovingTimer = millis();
			}
		}
		
		if(changeSideButton.readPin() && pressFlag[1] == 0) {
				pressFlag[1] = 1;
		}
		if(!changeSideButton.readPin() && pressFlag[1] == 1) {
			pwm+=10;
			
			pressFlag[1] = 0;
			dribblerOn++;
			if(dribblerOn >= 3) {
				dribblerOn = 0;
			}
		}
		
		if(imuReset.readPin()){
			gyro.read();
			gyro.setRotationByGyro();
			gyro.setRotation(0);
		}
		if (runFlag) {	
			//testAng = tsop.getDist();			
			if(CODE == ATTACKER) {
				int speedFastFast = 256 * 0.9;
				int speedFast = 256 * 0.8;
				int speedSlow = 256 * 0.45;
				
				int speedBack = 256 * 0.9;
				gyroFlag = 0;				
				math.setVector(0, 0);
				//tsop.setGyroAng(0);
				gyro.setMaxSpeed(256);
				dribblerOn = 0;
				cam.setGyroAng(gyro.getDev());
				if (startMovingFlag == 0) {
					if (kickState == 0) {
						kickSector = 0;
						if (cam.getAnotherCamDist() != 0) {
							gyro.setRotation(180 + cam.getAnotherCamAngle());
						} else { 
							gyro.setRotation(180);
						}
						 
						if (tsop.isCanSee() || ballCathed) {
							if (ballCathed) {
								if (goBackFlag == 0) {
									goBackFlag = 1;
									goBackTimer = millis();
								} else {
									gyro.setMaxSpeed(50);
									math.setVector(180, (millis() - goBackTimer) / 6 > speedBack ? speedBack : (millis() - goBackTimer) / 6);
								}								
								dribblerOn = 2;
								if (cam.getAnotherCamDist() != 0 && abs(cam.getAnotherCamDist() * cos(cam.getAnotherCamAngle() / 57.3)) < 90) {
									if (millis() - goBackTimer < 100) {
										mKick = 1;
									} else {
										mKick = 0;
									}
									kickTimer = millis();
									kickState = 1;
								}
							} else {
								goBackFlag = 0;
								if (abs(float(tsop.getAngle())) < 90) {
										dribblerOn = 2;
								}
								if (tsop.getDist() > BALL_IS_NEAR) {
									if (abs(float(tsop.getAngle())) < 90) {
										math.setVector(tsop.getAngle() + AngleOffset(tsop.getAngle(), tsop.getDist()), speedSlow);
									} else {
										math.setVector(tsop.getAngle() + AngleOffset(tsop.getAngle(), tsop.getDist()), speedFast);
									}
									//getFRWSpeed(tsop.getAngle(), speedFast, speedSlow));
								} else {
									math.setVector(tsop.getAngle() + AngleOffset(tsop.getAngle(), tsop.getDist()), speedFastFast);
								}
							}
						} else {
							math.setVector(0, 0);
						}
					} else {
						if (cam.getAnotherCamDist() != 0 && abs(cam.getAnotherCamDist() * cos(cam.getAnotherCamAngle() / 57.3)) > 90) {
							kickState = 0;
							continue;
						}
						dribblerOn = 2;
						if (cam.getAnotherCamDist() != 0) {
							gyro.setRotation(180 + cam.getAnotherCamAngle());
						} else {
							gyro.setRotation(180);
						}
						
						if (millis() - kickTimer > 1000) {
							kickState = 0;
							dribblerOn = 0;
							kickSector = 0;
							ballCathed = 0;
						} else {
							if (kickState == 1) {
								int dY = cam.getAnotherCamDist() * sin(cam.getAnotherCamAngle() / 57.3);
								int dX = cam.getAnotherCamDist() * cos(cam.getAnotherCamAngle() / 57.3);
								if (abs(float(cam.getAnotherCamAngle())) > 30) {
										if (dY < 0) {
											kickSector = 1;
										} else {
											kickSector = 6;
										}
								} else {
									if (dY < -30) {
										kickSector = 2;
									} else if (dY < 0) {
										kickSector = 3;
									} else if (dY < 30) {
										kickSector = 4;
									} else {
										kickSector = 5;
									}
								}
								kickState = 2;
								
								if (mKick == 1) {
									goBackTimer = millis();
								}
							} else if (kickState == 2) {
								if (millis() - goBackTimer < 250) {
									gyro.setRotation(180 + cam.getAnotherCamAngle());
								} else {
									dribblerOn = 2;
									switch(kickSector) {
									case 1:
										gyro.setRotation(-25 + cam.getAnotherCamAngle());
										break; 
									case 2:
										gyro.setRotation(25 + cam.getAnotherCamAngle());
										break;
									case 3:
										gyro.setRotation(25 + cam.getAnotherCamAngle());
										break;
									case 4:
										gyro.setRotation(-25 + cam.getAnotherCamAngle());
										break;
									case 5:
										gyro.setRotation(-25 + cam.getAnotherCamAngle());
										break;
									case 6:
										gyro.setRotation(25 + cam.getAnotherCamAngle());
										break;
									}
								}
							}
						}
					}
				} else {
					gyro.setRotation(0);
					if (tsop.getDist() > BALL_IS_NEAR) {
						if (abs(float(tsop.getAngle())) < 90) {
							math.setVector(tsop.getAngle() + AngleOffset(tsop.getAngle(), tsop.getDist()), speedSlow);
						} else {
							math.setVector(tsop.getAngle() + AngleOffset(tsop.getAngle(), tsop.getDist()), speedFast);
						}
					} else {
						math.setVector(tsop.getAngle() + AngleOffset(tsop.getAngle(), tsop.getDist()), speedFastFast);
					}
					dribblerOn = 2;
					if (millis() - startMovingTimer > 5000 || ballCathed) {
						startMovingFlag = 0;
					}
				}
				
