AlexM-dev/RoboCup-STM32/Lightweight/src/main/main.cpp
				int autX = 60;
					
				//if (cam.getCamDist() != 0 || cam.getAnotherCamDist() != 0) {
					if (cam.getCamDist() != 0) {
						if(abs(cam.getCamDist() * sin(cam.getCamAngle() / 57.3)) > 40 || abs(cam.getCamDist() * cos(cam.getCamAngle() / 57.3)) < 50)
						{
							if (math.getSpeed() > 150) {
								math.setSpeed(150);
							}
						}
						
						if(abs(cam.getCamDist() * sin(cam.getCamAngle() / 57.3)) < 40) {
							if(abs(cam.getCamDist() * cos(cam.getCamAngle() / 57.3)) < 40)  
							{
								math.setVector(0 - gyro.getTargetRobotAngle(), speedFast);
							}
						}
						
						if(abs(cam.getCamDist() * cos(cam.getCamAngle() / 57.3)) < 20)  
						{
							math.setVector(0 - gyro.getTargetRobotAngle(), speedFast);
						}
			
						if(cam.getCamDist() * sin(cam.getCamAngle() / 57.3) > autX)
						{
							math.addVector(90 - gyro.getTargetRobotAngle(), math.getSpeed() + speedFast);
						}
						if(cam.getCamDist() * sin(cam.getCamAngle() / 57.3) < -autX)
						{
							math.addVector(-90 - gyro.getTargetRobotAngle(), math.getSpeed() + speedFast);
						}
					}
					
					if (cam.getAnotherCamDist() != 0) {
						if(abs(cam.getAnotherCamDist() * sin(cam.getAnotherCamAngle() / 57.3)) > 40 || abs(cam.getAnotherCamDist() * cos(cam.getAnotherCamAngle() / 57.3)) < 50)
						{
							if (math.getSpeed() > 150) {
								math.setSpeed(150);
							}
						}
						
						if(abs(cam.getAnotherCamDist() * cos(cam.getAnotherCamAngle() / 57.3)) < 20)  
						{
							math.setVector(180 - gyro.getTargetRobotAngle(), speedFast);
						}
						if(cam.getAnotherCamDist() < 40)  
						{
							if(abs(float(cam.getAnotherCamAngle())) > 45) {
								math.addVector((180 + cam.getAnotherCamAngle()) - gyro.getTargetRobotAngle(), math.getSpeed() + speedSlow);
							} else {
								math.addVector(180 - gyro.getTargetRobotAngle(), math.getSpeed() + speedSlow);
							}
						}
						
						if(cam.getAnotherCamDist() * sin(cam.getAnotherCamAngle() / 57.3) < -autX)  
						{
							math.addVector(-90 - gyro.getTargetRobotAngle(), math.getSpeed() + speedSlow);
						}
						if(cam.getAnotherCamDist() * sin(cam.getAnotherCamAngle() / 57.3) > autX)  
						{
							math.addVector(90 - gyro.getTargetRobotAngle(), math.getSpeed() + speedSlow);
						}
					}
				//}
				//math.setVector(0, 0);
				//gyro.setRotation(180);
				k = gyro.getAngle();
				//kickSector = 2;
				//dribblerOn = 2;
			} else if (CODE == GOALKEEPER) {
				int speedGK = 210; 			
				int speedGKSlow = 210; 							
				math.setVector(0, 0);
				int angAng = 130;
				int tAng = 0;
				if (abs(float(tsop.getAngle())) > 90) {
					tAng = FAng(-tsop.getAngle()); 
				} else {
					tAng = FAng(tsop.getAngle() - cam.getCamAngle()); 
				}
				
				int yCoord = abs(cam.getCamDist() * cos(cam.getCamAngle() / 57.3));

				
				if(tsop.isCanSee()){
					if (abs(float(tAng)) < 170 || abs(float(tAng)) > 10) {
						if (abs(float(cam.getCamAngle())) > angAng) {
							if (tAng < 0) {
								math.setVector(90, getGKSpeed(tAng, speedGK));
							} else {
								math.setVector(-90, getGKSpeed(tAng, speedGK));
							}
						} else {
							if (tAng < 0) {
								if (cam.getCamAngle() < 0) {
									math.setVector(cam.getCamAngle() - 90, getGKSpeed(tAng, math.min(speedGK, speedGK * yCoord / 40)));
								} else {
									math.setVector(cam.getCamAngle() - 90, getGKSpeed(tAng, speedGK));
								}
							} else {
								if (cam.getCamAngle() > 0) {
									math.setVector(cam.getCamAngle() + 90, getGKSpeed(tAng, math.min(speedGK, speedGK * yCoord / 40)));
								} else {
									math.setVector(cam.getCamAngle() + 90, getGKSpeed(tAng, speedGK));
								}
							}
							if (yCoord < 30) {//(abs(float(cam.getCamAngle())) < 130) {
								if (cam.getCamAngle() < 0 && tAng < 0) {
									math.setVector(0, 0);
								}
								if (cam.getCamAngle() > 0 && tAng > 0) {
									math.setVector(0, 0);
								}
							}
						}
					} else {
						math.setVector(0, 0);
					}
				} else {
					if (abs(float(cam.getCamAngle())) < 170) {
						if (cam.getCamAngle() > 0) {
							math.setVector(cam.getCamAngle() - 90, speedGKSlow);
						} else {
							math.setVector(cam.getCamAngle() + 90, speedGKSlow);
						}
					} else {
						math.setVector(0, 0);
					}
				}
				
				//STOP FLAGS
				if (yCoord < 30) { //(abs(float(cam.getCamAngle())) < 130) {
					if((abs(double(cam.getCamAngle())) > 90 && tsop.getDist() > 50) && tAng < 0) {
						math.setVector(0, 0);
					}
					if((abs(double(cam.getCamAngle())) > 90 && tsop.getDist() > 50) && tAng > 0) {
						math.setVector(0, 0);
					}
				}
				
				gkGo = 0; //TEMP
				if(tsop.isCanSee()) {
					if (abs(float(tAng)) > 160 && tsop.getDist() > 30) { 
						if (gkGo == 0) { 
							gkGo = 1;
							timer = millis();
						}
						if (gkGo == 1 && millis() - timer > 1500) { 
							gkGo = 2;
							timer = millis();
						}
						if (gkGo == 2 && millis() - timer < 3000) { 
							math.setVector(tsop.getAngle() + AngleOffset(tsop.getAngle(), tsop.getDist()), 140);
						}
						if (gkGo == 2 && millis() - timer >= 3000) { 
							gkGo = 0;
						}
					}
				}
				gkGo = 0; //TEMP

				if (gkGo != 2) {
					if (abs(float(cam.getCamAngle())) > angAng) {	
						if (yCoord > 30) {
							math.addVector(180, getGKSpeedSlow(yCoord - 30, speedGK));
						} else {
							math.addVector(0, getGKSpeedSlow(yCoord - 30, speedGK));
						}
					} else {
						if (cam.getCamDist() > 40) {
							math.addVector(cam.getCamAngle(), getGKSpeedSlow(cam.getCamDist() - 40, speedGK));	
						} else {
							math.addVector(cam.getCamAngle() + 180, getGKSpeedSlow(cam.getCamDist() - 40, speedGK));
						}
					}
				} else {
					if (abs(cam.getCamDist() * sin(cam.getCamAngle() / 57.3)) > 50 || tsop.getDist() < 20) {
						gkGo = 0;
					}
				}
				
				if (yCoord < 15) {
					math.setVector(0, speedGK);
				} 
				
				testAng = tAng;
				//math.setVector(0, 0);
				k = gyro.getAngle();
			} else if (CODE == DEBUG) {
				dribblerOn = 0;
				if (tsop.isCanSee()) {
					if (tsop.getDist() > BALL_IS_REALLY_NEAR) {
						dribblerOn = 2;
					} else if (tsop.getDist() > BALL_IS_NEAR) {
						dribblerOn = 1;
					}
				}
			} else if (CODE == SNIPER) {
				int speed = 256 * 0.55;
				gyroFlag = 0;				
				math.setVector(0, 0);
				gyro.setMaxSpeed(256);
				dribblerOn = 0;
				cam.setGyroAng(gyro.getDev());
				gyro.setRotation(180);
				
				if (kickState == 0) {					 
					if (tsop.isCanSee() || ballCathed) {
						if (ballCathed) {
							float dX = cam.getAnotherCamDist() * sin(cam.getAnotherCamAngle() / 57.3);
							float dY = cam.getAnotherCamDist() * cos(cam.getAnotherCamAngle() / 57.3);
							gyro.setMaxSpeed(50);
							math.setVector(cam.getAnotherCamAngle() > 0 ? -90 : 90, getGKSpeed(cam.getAnotherCamAngle(), speed));
							if (dY < 30) {
								math.addVector(180, getGKSpeedSlow(30 - dY, speed));
							} else {
								math.addVector(0, getGKSpeedSlow(dY - 30, speed));
							}
							dribblerOn = 2;
							
							if (abs(30 - dY) < 5 && abs(float(cam.getAnotherCamAngle())) < 5) {
								kickTimer = millis();
								kickState = 1;
							}
						} else {
							dribblerOn = 2;
							math.setVector(tsop.getAngle() + AngleOffset(tsop.getAngle(), tsop.getDist()), speed);
						}
					} else {
						math.setVector(0, 0);
					}
				} else {
					dribblerOn = 2;
					if (millis() - kickTimer < 300) {
						math.setVector(180, 250);
					} else if (millis() - kickTimer < 500) {
						math.setVector(135, 250);
					} else if (millis() - kickTimer < 1000) {
						math.setVector(90, 250);
					} else {
						math.setVector(0, 0);
					}
				}
			} else if (CODE == PENALTY) {
				//TODO
			}
		} else {
			//dribbler.pwm(90);
			math.setVector(0, 0);
			timer = 0;
			f = false;
			k = 0;
			testAng = tsop.getDist();
			kickSector = 0;
		}		
		if (dribblerOn == 0) {
			dribbler.pwm(120);
		} else if (dribblerOn == 1) {
			dribbler.pwm(250);
		} else if (dribblerOn == 2) {
			dribbler.pwm(250);
		}
		math.calculateSpeed(math.getAngle(), math.getSpeed(), sp1, sp2, sp3, sp4);
		
		if (kickSector == 0) {
			robot.move(sp1 + k, sp2 + k, sp3 + k, sp4 + k, math.getPeriod());
		} else {
			if (kickSector == 1 || kickSector == 6) {
				gyro.setMaxSpeed(160);
				k = gyro.getRotationKForRotateToBall(5, 3, 0.1);
			} else {
				gyro.setMaxSpeed(180);
				k = gyro.getRotationKForRotateToBall(3, 1.6, 0.05);
			}
			robot.move(sp1 + k, sp2 + k, sp3 + k, sp4 + k, math.getPeriod());
		}
	}
}